---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterIntegerRule
source: html/7b62b5f1-ab6d-66c6-2d5a-991ad6af8350.htm
---
# FilterIntegerRule Properties

Specifies whether the .NET object represents a valid Revit entity.